# Welcome pandas tutorial

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\jupiteraccs\lib\site-packages (1.2.4)
Requirement already satisfied: numpy>=1.16.5 in c:\jupiteraccs\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: pytz>=2017.3 in c:\jupiteraccs\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\jupiteraccs\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\jupiteraccs\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import numpy as np
import pandas as pd

In [5]:
a = pd.Series([1,2,3,4])
a

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
print(a[2])

3

In [7]:
a[1:3]

1    2
2    3
dtype: int64

In [8]:
s = pd.Series(['a','b','c','d'])
s

0    a
1    b
2    c
3    d
dtype: object

In [9]:
# series from numpy

In [11]:
data = np.array([90,80,67,56,45,34])
a = pd.Series(data)
a

0    90
1    80
2    67
3    56
4    45
5    34
dtype: int32

In [14]:
## Data accesing using index

In [16]:
a

0    90
1    80
2    67
3    56
4    45
5    34
dtype: int32

In [17]:
a[2]

67

In [18]:
a[1:]

1    80
2    67
3    56
4    45
5    34
dtype: int32

In [19]:
a[[1,2]]

1    80
2    67
dtype: int32

In [20]:
# Naming the index

In [21]:
a

0    90
1    80
2    67
3    56
4    45
5    34
dtype: int32

In [22]:
p = pd.Series([1,2,3,4,5,6], index=['A','B','C','D','E','F'])
p

A    1
B    2
C    3
D    4
E    5
F    6
dtype: int64

In [23]:
p['A']

1

# PANDAS DATAFRAME

In [24]:
# data frmae using dict

In [26]:
data = {'Name':['Piyush','Taniya','Krishna','Pooja'], 'Age':[20,19,16,21]}
df = pd.DataFrame(data)
df

      Name  Age
0   Piyush   20
1   Taniya   19
2  Krishna   16
3    Pooja   21

In [28]:
data = {'Name':['Piyush','Taniya','Krishna','Pooja'], 'Age':[20,19,16,21], 'Gender':['Male','Female','MAle','Female']}
df = pd.DataFrame(data,index = ['A','B','C','D'])
print(df)

      Name  Age  Gender
A   Piyush   20    Male
B   Taniya   19  Female
C  Krishna   16    MAle
D    Pooja   21  Female

In [29]:
df = pd.DataFrame({
    'pro1':['apple','samsung','nokia','lg'],
    'price' :['1lk','50k','20k','17k'],
    'mark ':[5,4,1,np.nan]})
print(df)

      pro1 price  mark
0    apple   1lk    5.0
1  samsung   50k    4.0
2    nokia   20k    1.0
3       lg   17k    NaN

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pro1    4 non-null      object
 1   price   4 non-null      object
 2   mark    3 non-null      float64
dtypes: float64(1), object(2)
memory usage: 224.0+ bytes

In [36]:
data = [('1-jan-2021',20 , 5 , 'fog'),
        ('12-jan-2021',4 , 1 , 'snow'),
        ('15-jan-2021',23 , 5 , 'sunny'),
        ('6-jan-2021',17 , 9 , 'rain')]
df = pd.DataFrame(data, columns = ['DAY','TEMPERATURE','WINDSPEED','CLIMATE'])
df

           DAY  TEMPERATURE  WINDSPEED CLIMATE
0   1-jan-2021           20          5     fog
1  12-jan-2021            4          1    snow
2  15-jan-2021           23          5   sunny
3   6-jan-2021           17          9    rain

In [37]:
df.head(2)

           DAY  TEMPERATURE  WINDSPEED CLIMATE
0   1-jan-2021           20          5     fog
1  12-jan-2021            4          1    snow

In [38]:
df.tail(2)

           DAY  TEMPERATURE  WINDSPEED CLIMATE
2  15-jan-2021           23          5   sunny
3   6-jan-2021           17          9    rain

In [39]:
dict = {'Name':pd.Series(['Tom', 'Jack', 'Steve', 'Ricky', 'Vin', 'James', 'Vin']),
       'Age':pd.Series([25,26,25,35,23,33,31]),
       'Rating':pd.Series([4.23,4.1,3.4,5,2.9,4.7,3.1])}

df = pd.DataFrame(dict)
df

    Name  Age  Rating
0    Tom   25    4.23
1   Jack   26    4.10
2  Steve   25    3.40
3  Ricky   35    5.00
4    Vin   23    2.90
5  James   33    4.70
6    Vin   31    3.10

In [40]:
df.sum()

Name      TomJackSteveRickyVinJamesVin
Age                                198
Rating                           27.43
dtype: object

In [41]:
df.sum((1))

0    29.23
1    30.10
2    28.40
3    40.00
4    25.90
5    37.70
6    34.10
dtype: float64

In [42]:
df.mean()

Age       28.285714
Rating     3.918571
dtype: float64

In [43]:
df.std()

Age       4.644505
Rating    0.804828
dtype: float64

In [44]:
df.describe()

             Age    Rating
count   7.000000  7.000000
mean   28.285714  3.918571
std     4.644505  0.804828
min    23.000000  2.900000
25%    25.000000  3.250000
50%    26.000000  4.100000
75%    32.000000  4.465000
max    35.000000  5.000000

In [45]:
df.describe(include=['object'])

       Name
count     7
unique    6
top     Vin
freq      2

In [46]:
df.describe(include=['number'])

             Age    Rating
count   7.000000  7.000000
mean   28.285714  3.918571
std     4.644505  0.804828
min    23.000000  2.900000
25%    25.000000  3.250000
50%    26.000000  4.100000
75%    32.000000  4.465000
max    35.000000  5.000000

# Working with .csv


Iris DAtasets

In [54]:
pwd

'C:\\Users\\user\\DATA_SCIENCE\\Data_Vizualation'

In [57]:
df = pd.read_csv('C:\\Users\\user\\Desktop\\New folder\\pandas1\\Iris.csv')
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [58]:
df.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [59]:
df.shape

(150, 6)

In [60]:
df.columns

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')

In [61]:
df.mean()

Id               75.500000
SepalLengthCm     5.843333
SepalWidthCm      3.054000
PetalLengthCm     3.758667
PetalWidthCm      1.198667
dtype: float64

In [62]:
df.std()

Id               43.445368
SepalLengthCm     0.828066
SepalWidthCm      0.433594
PetalLengthCm     1.764420
PetalWidthCm      0.763161
dtype: float64

In [63]:
df.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [64]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [66]:
df.describe(include=['object'])

               Species
count              150
unique               3
top     Iris-virginica
freq                50

# WEATHER DATASEAT

In [67]:
df = pd.read_csv("C:\\Users\\user\\Desktop\\New folder\\pandas1\\nyc_weather.csv")

In [69]:
df

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333
5,1/6/2016,33,4,35,30.50,10,4.0,0,0,NaN,259
6,1/7/2016,39,11,33,30.28,10,2.0,0,3,NaN,293
7,1/8/2016,39,29,64,30.20,10,4.0,0,8,NaN,79
8,1/9/2016,44,38,77,30.16,9,8.0,T,8,Rain,76
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109
10,1/11/2016,33,8,37,29.92,10,NaN,0,1,NaN,289
11,1/12/2016,35,15,53,29.85,10,6.0,T,4,NaN,235
12,1/13/2016,26,4,42,29.94,10,10.0,0,0,NaN,284
13,1/14/2016,30,12,47,29.95,10,5.0,T,7,NaN,266
14,1/15/2016,43,31,62,29.82,9,5.0,T,2,NaN,101
15,1/16/2016,47,37,70,29.52,8,7.0,0.24,7,Rain,340
16,1/17/2016,36,23,66,29.78,8,6.0,0.05,6,Fog-Snow,345
17,1/18/2016,25,6,53,29.83,9,12.0,T,2,Snow,293
18,1/19/2016,22,3,42,30.03,10,11.0,0,1,NaN,293
19,1/20/2016,32,15,49,30.13,10,6.0,0,2,NaN,302
20,1/21/2016,31,11,45,30.15,10,6.0,0,1,NaN,312
21,1/22/2016,26,6,41,30.21,9,NaN,0.01,3,Snow,34
22,1/23/2016,26,21,78,29.77,1,16.0,2.31,8,Fog-Snow,42
23,1/24/2016,28,11,53,29.92,8,6.0,T,3,Snow,327
24,1/25/2016,34,18,54,30.25,10,3.0,0,2,NaN,286
25,1/26/2016,43,29,56,30.03,10,7.0,0,2,NaN,244
26,1/27/2016,41,22,45,30.03,10,7.0,T,3,Rain,311
27,1/28/2016,37,20,51,29.90,10,5.0,0,1,NaN,234
28,1/29/2016,36,21,50,29.58,10,8.0,0,4,NaN,298
29,1/30/2016,34,16,46,30.01,10,7.0,0,0,NaN,257
30,1/31/2016,46,28,52,29.90,10,5.0,0,0,NaN,241

In [71]:
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [72]:
df['Temperature'].max()

50

In [74]:
df['DewPoint'].min()

-3

In [75]:
df[df.Temperature== df.Temperature.max()]

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
9,1/10/2016,50,46,71,29.59,4,NaN,1.8,7,Rain,109